src/k-bench-results/kubeEdge/reliability-control/reliability-control-3/memtier.out
4         Threads
50        Connections per thread
600       Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets         1366.62          ---          ---        13.29241        12.15900        28.03100        47.61500       105.28 
Gets        13664.42         4.67     13659.75        13.29374        12.09500        28.03100        47.10300       532.42 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals      15031.04         4.67     13659.75        13.29362        12.09500        28.03100        47.10300       637.70 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.983        0.000
SET      10.687        5.000
SET      11.199       10.000
SET      11.391       15.000
SET      11.519       20.000
SET      11.647       25.000
SET      11.711       30.000
SET      11.839       35.000
SET      11.903       40.000
SET      12.031       45.000
SET      12.159       50.000
SET      12.223       52.500
SET      12.287       55.000
SET      12.351       57.500
SET      12.415       60.000
SET      12.479       62.500
SET      12.543       65.000
SET      12.671       67.500
SET      12.735       70.000
SET      12.863       72.500
SET      12.991       75.000
SET      13.055       76.250
SET      13.183       77.500
SET      13.247       78.750
SET      13.375       80.000
SET      13.503       81.250
SET      13.695       82.500
SET      13.951       83.750
SET      14.271       85.000
SET      14.655       86.250
SET      15.167       87.500
SET      15.487       88.125
SET      15.807       88.750
SET      16.255       89.375
SET      16.895       90.000
SET      17.791       90.625
SET      19.071       91.250
SET      20.351       91.875
SET      21.247       92.500
SET      22.015       93.125
SET      22.527       93.750
SET      22.783       94.062
SET      22.911       94.375
SET      23.039       94.688
SET      23.295       95.000
SET      23.423       95.312
SET      23.551       95.625
SET      23.679       95.938
SET      23.935       96.250
SET      24.063       96.562
SET      24.319       96.875
SET      24.447       97.031
SET      24.575       97.188
SET      24.703       97.344
SET      24.831       97.500
SET      24.959       97.656
SET      25.215       97.812
SET      25.343       97.969
SET      25.599       98.125
SET      25.855       98.281
SET      26.111       98.438
SET      26.239       98.516
SET      26.495       98.594
SET      26.623       98.672
SET      26.879       98.750
SET      27.135       98.828
SET      27.519       98.906
SET      28.031       98.984
SET      28.543       99.062
SET      29.183       99.141
SET      29.951       99.219
SET      30.463       99.258
SET      30.975       99.297
SET      31.487       99.336
SET      32.127       99.375
SET      32.767       99.414
SET      33.535       99.453
SET      34.047       99.492
SET      34.815       99.531
SET      35.839       99.570
SET      36.863       99.609
SET      37.375       99.629
SET      37.887       99.648
SET      38.399       99.668
SET      39.167       99.688
SET      39.679       99.707
SET      40.191       99.727
SET      40.959       99.746
SET      41.471       99.766
SET      42.239       99.785
SET      42.751       99.805
SET      43.263       99.814
SET      43.519       99.824
SET      44.031       99.834
SET      44.287       99.844
SET      44.799       99.854
SET      45.311       99.863
SET      45.823       99.873
SET      46.591       99.883
SET      47.103       99.893
SET      47.615       99.902
SET      47.871       99.907
SET      48.127       99.912
SET      48.639       99.917
SET      48.895       99.922
SET      49.407       99.927
SET      49.919       99.932
SET      50.175       99.937
SET      50.687       99.941
SET      51.199       99.946
SET      51.711       99.951
SET      51.967       99.954
SET      52.223       99.956
SET      52.735       99.958
SET      52.991       99.961
SET      53.503       99.963
SET      53.759       99.966
SET      54.015       99.968
SET      54.271       99.971
SET      54.783       99.973
SET      55.295       99.976
SET      55.807       99.977
SET      56.319       99.978
SET      56.831       99.979
SET      57.087       99.980
SET      57.343       99.982
SET      57.599       99.983
SET      58.111       99.984
SET      58.623       99.985
SET      59.391       99.987
SET      59.903       99.988
SET      60.415       99.988
SET      60.927       99.989
SET      61.183       99.990
SET      61.439       99.990
SET      61.951       99.991
SET      62.207       99.991
SET      62.463       99.992
SET      62.975       99.993
SET      63.487       99.993
SET      64.511       99.994
SET      64.767       99.994
SET      65.023       99.995
SET      65.023       99.995
SET      66.047       99.995
SET      66.559       99.995
SET      66.559       99.996
SET      67.583       99.996
SET      68.095       99.996
SET      68.607       99.997
SET      69.119       99.997
SET      69.631       99.997
SET      69.631       99.997
SET      69.631       99.997
SET      70.143       99.998
SET      70.655       99.998
SET      71.167       99.998
SET      71.167       99.998
SET      71.679       99.998
SET      72.191       99.998
SET      72.703       99.998
SET      72.703       99.999
SET      72.703       99.999
SET      73.215       99.999
SET      73.215       99.999
SET      73.215       99.999
SET      75.263       99.999
SET      75.263       99.999
SET      76.799       99.999
SET      78.335       99.999
SET      78.335       99.999
SET      78.335       99.999
[...]
SET      79.871       99.999
SET      79.871       99.999
SET      79.871      100.000
SET      79.871      100.000
SET      79.871      100.000
[...]
SET      82.943      100.000
SET      82.943      100.000
SET      82.943      100.000
[...]
SET      83.967      100.000
SET      83.967      100.000
SET      83.967      100.000
[...]
SET      94.207      100.000
SET      94.207      100.000
---
GET       0.487        0.000
GET      10.687        5.000
GET      11.199       10.000
GET      11.391       15.000
GET      11.519       20.000
GET      11.647       25.000
GET      11.711       30.000
GET      11.839       35.000
GET      11.903       40.000
GET      12.031       45.000
GET      12.095       50.000
GET      12.223       52.500
GET      12.287       55.000
GET      12.351       57.500
GET      12.415       60.000
GET      12.479       62.500
GET      12.543       65.000
GET      12.671       67.500
GET      12.735       70.000
GET      12.863       72.500
GET      12.991       75.000
GET      13.055       76.250
GET      13.183       77.500
GET      13.247       78.750
GET      13.375       80.000
GET      13.503       81.250
GET      13.695       82.500
GET      13.951       83.750
GET      14.271       85.000
GET      14.655       86.250
GET      15.167       87.500
GET      15.487       88.125
GET      15.807       88.750
GET      16.319       89.375
GET      17.023       90.000
GET      17.919       90.625
GET      19.199       91.250
GET      20.351       91.875
GET      21.375       92.500
GET      22.015       93.125
GET      22.527       93.750
GET      22.783       94.062
GET      22.911       94.375
GET      23.039       94.688
GET      23.295       95.000
GET      23.423       95.312
GET      23.551       95.625
GET      23.679       95.938
GET      23.935       96.250
GET      24.063       96.562
GET      24.319       96.875
GET      24.447       97.031
GET      24.575       97.188
GET      24.703       97.344
GET      24.831       97.500
GET      24.959       97.656
GET      25.215       97.812
GET      25.343       97.969
GET      25.599       98.125
GET      25.855       98.281
GET      26.111       98.438
GET      26.239       98.516
GET      26.367       98.594
GET      26.623       98.672
GET      26.879       98.750
GET      27.135       98.828
GET      27.519       98.906
GET      28.031       98.984
GET      28.543       99.062
GET      29.183       99.141
GET      29.951       99.219
GET      30.463       99.258
GET      30.975       99.297
GET      31.487       99.336
GET      32.127       99.375
GET      32.767       99.414
GET      33.535       99.453
GET      34.303       99.492
GET      35.071       99.531
GET      35.839       99.570
GET      36.863       99.609
GET      37.375       99.629
GET      37.887       99.648
GET      38.399       99.668
GET      38.911       99.688
GET      39.423       99.707
GET      40.191       99.727
GET      40.703       99.746
GET      41.471       99.766
GET      42.239       99.785
GET      42.751       99.805
GET      43.263       99.814
GET      43.519       99.824
GET      44.031       99.834
GET      44.287       99.844
GET      44.799       99.854
GET      45.311       99.863
GET      45.567       99.873
GET      46.079       99.883
GET      46.847       99.893
GET      47.359       99.902
GET      47.615       99.907
GET      47.871       99.912
GET      48.383       99.917
GET      48.639       99.922
GET      49.151       99.927
GET      49.407       99.932
GET      49.919       99.937
GET      50.431       99.941
GET      50.943       99.946
GET      51.455       99.951
GET      51.711       99.954
GET      52.223       99.956
GET      52.479       99.958
GET      52.735       99.961
GET      53.247       99.963
GET      53.503       99.966
GET      54.015       99.968
GET      54.527       99.971
GET      54.783       99.973
GET      55.551       99.976
GET      55.807       99.977
GET      56.063       99.978
GET      56.319       99.979
GET      56.831       99.980
GET      57.087       99.982
GET      57.599       99.983
GET      58.111       99.984
GET      58.623       99.985
GET      59.135       99.987
GET      59.647       99.988
GET      59.903       99.988
GET      60.159       99.989
GET      60.671       99.990
GET      61.183       99.990
GET      61.439       99.991
GET      61.695       99.991
GET      62.207       99.992
GET      62.975       99.993
GET      63.487       99.993
GET      63.999       99.994
GET      64.511       99.994
GET      64.767       99.995
GET      65.279       99.995
GET      66.047       99.995
GET      66.047       99.995
GET      66.559       99.996
GET      67.071       99.996
GET      67.583       99.996
GET      68.095       99.997
GET      69.119       99.997
GET      69.631       99.997
GET      69.631       99.997
GET      70.143       99.997
GET      70.655       99.998
GET      71.167       99.998
GET      71.167       99.998
GET      71.679       99.998
GET      72.191       99.998
GET      72.703       99.998
GET      73.215       99.998
GET      74.239       99.999
GET      74.751       99.999
GET      75.263       99.999
GET      75.775       99.999
GET      76.287       99.999
GET      77.311       99.999
GET      78.335       99.999
GET      78.335       99.999
GET      78.847       99.999
GET      79.359       99.999
GET      79.359       99.999
GET      79.871       99.999
GET      80.383       99.999
GET      80.383       99.999
GET      80.895       99.999
GET      81.407       99.999
GET      81.407      100.000
GET      81.919      100.000
GET      82.943      100.000
GET      83.455      100.000
GET      83.455      100.000
GET      83.455      100.000
GET      83.967      100.000
GET      84.479      100.000
GET      84.479      100.000
GET      85.503      100.000
GET      86.015      100.000
GET      86.015      100.000
GET      86.015      100.000
GET      86.527      100.000
GET      86.527      100.000
GET      86.527      100.000
GET      87.551      100.000
GET      88.575      100.000
GET      89.087      100.000
GET      90.111      100.000
GET      90.111      100.000
GET      90.623      100.000
GET      90.623      100.000
GET      91.135      100.000
GET      91.135      100.000
GET      91.135      100.000
GET      91.647      100.000
GET      91.647      100.000
GET      92.159      100.000
GET      92.159      100.000
GET      92.159      100.000
GET      92.671      100.000
GET      92.671      100.000
GET      93.183      100.000
GET      93.183      100.000
GET      93.183      100.000
[...]
GET      93.695      100.000
GET      93.695      100.000
GET      93.695      100.000
[...]
GET      95.231      100.000
GET      95.231      100.000
GET      95.231      100.000
[...]
GET      95.743      100.000
GET      95.743      100.000
---
WAIT      0.000      100.000